Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/edc/PIC32MZ2048EFM144.PIC
      <edc:SFRDef edc:_addr="0x1F810270" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC19" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC19" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD17IS" edc:desc="" edc:mask="0x3" edc:name="ADCD17IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD17IP" edc:desc="" edc:mask="0x7" edc:name="ADCD17IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD18IS" edc:desc="" edc:mask="0x3" edc:name="ADCD18IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD18IP" edc:desc="" edc:mask="0x7" edc:name="ADCD18IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD19IS" edc:desc="" edc:mask="0x3" edc:name="ADCD19IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD19IP" edc:desc="" edc:mask="0x7" edc:name="ADCD19IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD20IS" edc:desc="" edc:mask="0x3" edc:name="ADCD20IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD20IP" edc:desc="" edc:mask="0x7" edc:name="ADCD20IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810280" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC20" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC20" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD21IS" edc:desc="" edc:mask="0x3" edc:name="ADCD21IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD21IP" edc:desc="" edc:mask="0x7" edc:name="ADCD21IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD22IS" edc:desc="" edc:mask="0x3" edc:name="ADCD22IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD22IP" edc:desc="" edc:mask="0x7" edc:name="ADCD22IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD23IS" edc:desc="" edc:mask="0x3" edc:name="ADCD23IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD23IP" edc:desc="" edc:mask="0x7" edc:name="ADCD23IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD24IS" edc:desc="" edc:mask="0x3" edc:name="ADCD24IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD24IP" edc:desc="" edc:mask="0x7" edc:name="ADCD24IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810290" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC21" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC21" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD25IS" edc:desc="" edc:mask="0x3" edc:name="ADCD25IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD25IP" edc:desc="" edc:mask="0x7" edc:name="ADCD25IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD26IS" edc:desc="" edc:mask="0x3" edc:name="ADCD26IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD26IP" edc:desc="" edc:mask="0x7" edc:name="ADCD26IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD27IS" edc:desc="" edc:mask="0x3" edc:name="ADCD27IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD27IP" edc:desc="" edc:mask="0x7" edc:name="ADCD27IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD28IS" edc:desc="" edc:mask="0x3" edc:name="ADCD28IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD28IP" edc:desc="" edc:mask="0x7" edc:name="ADCD28IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8102A0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC22" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC22" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD29IS" edc:desc="" edc:mask="0x3" edc:name="ADCD29IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD29IP" edc:desc="" edc:mask="0x7" edc:name="ADCD29IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD30IS" edc:desc="" edc:mask="0x3" edc:name="ADCD30IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD30IP" edc:desc="" edc:mask="0x7" edc:name="ADCD30IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD31IS" edc:desc="" edc:mask="0x3" edc:name="ADCD31IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD31IP" edc:desc="" edc:mask="0x7" edc:name="ADCD31IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD32IS" edc:desc="" edc:mask="0x3" edc:name="ADCD32IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD32IP" edc:desc="" edc:mask="0x7" edc:name="ADCD32IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8102B0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC23" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC23" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD33IS" edc:desc="" edc:mask="0x3" edc:name="ADCD33IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD33IP" edc:desc="" edc:mask="0x7" edc:name="ADCD33IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD34IS" edc:desc="" edc:mask="0x3" edc:name="ADCD34IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD34IP" edc:desc="" edc:mask="0x7" edc:name="ADCD34IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD35IS" edc:desc="" edc:mask="0x3" edc:name="ADCD35IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD35IP" edc:desc="" edc:mask="0x7" edc:name="ADCD35IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD36IS" edc:desc="" edc:mask="0x3" edc:name="ADCD36IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD36IP" edc:desc="" edc:mask="0x7" edc:name="ADCD36IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8102C0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC24" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC24" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD37IS" edc:desc="" edc:mask="0x3" edc:name="ADCD37IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD37IP" edc:desc="" edc:mask="0x7" edc:name="ADCD37IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD38IS" edc:desc="" edc:mask="0x3" edc:name="ADCD38IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD38IP" edc:desc="" edc:mask="0x7" edc:name="ADCD38IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD39IS" edc:desc="" edc:mask="0x3" edc:name="ADCD39IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD39IP" edc:desc="" edc:mask="0x7" edc:name="ADCD39IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD40IS" edc:desc="" edc:mask="0x3" edc:name="ADCD40IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD40IP" edc:desc="" edc:mask="0x7" edc:name="ADCD40IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8102D0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC25" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC25" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD41IS" edc:desc="" edc:mask="0x3" edc:name="ADCD41IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD41IP" edc:desc="" edc:mask="0x7" edc:name="ADCD41IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD42IS" edc:desc="" edc:mask="0x3" edc:name="ADCD42IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD42IP" edc:desc="" edc:mask="0x7" edc:name="ADCD42IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD43IS" edc:desc="" edc:mask="0x3" edc:name="ADCD43IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD43IP" edc:desc="" edc:mask="0x7" edc:name="ADCD43IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD44IS" edc:desc="" edc:mask="0x3" edc:name="ADCD44IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD44IP" edc:desc="" edc:mask="0x7" edc:name="ADCD44IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8102E0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC26" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC26" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CPCIS" edc:desc="" edc:mask="0x3" edc:name="CPCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CPCIP" edc:desc="" edc:mask="0x7" edc:name="CPCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CFDCIS" edc:desc="" edc:mask="0x3" edc:name="CFDCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CFDCIP" edc:desc="" edc:mask="0x7" edc:name="CFDCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SBIS" edc:desc="" edc:mask="0x3" edc:name="SBIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SBIP" edc:desc="" edc:mask="0x7" edc:name="SBIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CRPTIS" edc:desc="" edc:mask="0x3" edc:name="CRPTIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CRPTIP" edc:desc="" edc:mask="0x7" edc:name="CRPTIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8102F0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn--------" edc:cname="IPC27" edc:desc="" edc:impl="0xffffff00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000--------" edc:name="IPC27" edc:nzwidth="32" edc:por="---00000---00000---00000--------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI1EIS" edc:desc="" edc:mask="0x3" edc:name="SPI1EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI1EIP" edc:desc="" edc:mask="0x7" edc:name="SPI1EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI1RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI1RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI1TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI1TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffff00" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
