Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/edc/PIC32MZ2048EFM144.PIC
      <edc:SFRDef edc:_addr="0x1F860830" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="LATJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="LATJ" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATJ0" edc:desc="" edc:mask="0x1" edc:name="LATJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ1" edc:desc="" edc:mask="0x1" edc:name="LATJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ2" edc:desc="" edc:mask="0x1" edc:name="LATJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ3" edc:desc="" edc:mask="0x1" edc:name="LATJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ4" edc:desc="" edc:mask="0x1" edc:name="LATJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ5" edc:desc="" edc:mask="0x1" edc:name="LATJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ6" edc:desc="" edc:mask="0x1" edc:name="LATJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ7" edc:desc="" edc:mask="0x1" edc:name="LATJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ8" edc:desc="" edc:mask="0x1" edc:name="LATJ8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATJ9" edc:desc="" edc:mask="0x1" edc:name="LATJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ10" edc:desc="" edc:mask="0x1" edc:name="LATJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ11" edc:desc="" edc:mask="0x1" edc:name="LATJ11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATJ12" edc:desc="" edc:mask="0x1" edc:name="LATJ12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATJ13" edc:desc="" edc:mask="0x1" edc:name="LATJ13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATJ14" edc:desc="" edc:mask="0x1" edc:name="LATJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ15" edc:desc="" edc:mask="0x1" edc:name="LATJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860840" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ODCJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="ODCJ" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCJ0" edc:desc="" edc:mask="0x1" edc:name="ODCJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ1" edc:desc="" edc:mask="0x1" edc:name="ODCJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ2" edc:desc="" edc:mask="0x1" edc:name="ODCJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ3" edc:desc="" edc:mask="0x1" edc:name="ODCJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ4" edc:desc="" edc:mask="0x1" edc:name="ODCJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ5" edc:desc="" edc:mask="0x1" edc:name="ODCJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ6" edc:desc="" edc:mask="0x1" edc:name="ODCJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ7" edc:desc="" edc:mask="0x1" edc:name="ODCJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ8" edc:desc="" edc:mask="0x1" edc:name="ODCJ8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCJ9" edc:desc="" edc:mask="0x1" edc:name="ODCJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ10" edc:desc="" edc:mask="0x1" edc:name="ODCJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ11" edc:desc="" edc:mask="0x1" edc:name="ODCJ11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCJ12" edc:desc="" edc:mask="0x1" edc:name="ODCJ12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCJ13" edc:desc="" edc:mask="0x1" edc:name="ODCJ13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCJ14" edc:desc="" edc:mask="0x1" edc:name="ODCJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ15" edc:desc="" edc:mask="0x1" edc:name="ODCJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860850" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPUJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNPUJ" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUJ0" edc:desc="" edc:mask="0x1" edc:name="CNPUJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ1" edc:desc="" edc:mask="0x1" edc:name="CNPUJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ2" edc:desc="" edc:mask="0x1" edc:name="CNPUJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ3" edc:desc="" edc:mask="0x1" edc:name="CNPUJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ4" edc:desc="" edc:mask="0x1" edc:name="CNPUJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ5" edc:desc="" edc:mask="0x1" edc:name="CNPUJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ6" edc:desc="" edc:mask="0x1" edc:name="CNPUJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ7" edc:desc="" edc:mask="0x1" edc:name="CNPUJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ8" edc:desc="" edc:mask="0x1" edc:name="CNPUJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ9" edc:desc="" edc:mask="0x1" edc:name="CNPUJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ10" edc:desc="" edc:mask="0x1" edc:name="CNPUJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ11" edc:desc="" edc:mask="0x1" edc:name="CNPUJ11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ12" edc:desc="" edc:mask="0x1" edc:name="CNPUJ12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ13" edc:desc="" edc:mask="0x1" edc:name="CNPUJ13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ14" edc:desc="" edc:mask="0x1" edc:name="CNPUJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ15" edc:desc="" edc:mask="0x1" edc:name="CNPUJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860860" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPDJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNPDJ" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDJ0" edc:desc="" edc:mask="0x1" edc:name="CNPDJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ1" edc:desc="" edc:mask="0x1" edc:name="CNPDJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ2" edc:desc="" edc:mask="0x1" edc:name="CNPDJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ3" edc:desc="" edc:mask="0x1" edc:name="CNPDJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ4" edc:desc="" edc:mask="0x1" edc:name="CNPDJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ5" edc:desc="" edc:mask="0x1" edc:name="CNPDJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ6" edc:desc="" edc:mask="0x1" edc:name="CNPDJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ7" edc:desc="" edc:mask="0x1" edc:name="CNPDJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ8" edc:desc="" edc:mask="0x1" edc:name="CNPDJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ9" edc:desc="" edc:mask="0x1" edc:name="CNPDJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ10" edc:desc="" edc:mask="0x1" edc:name="CNPDJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ11" edc:desc="" edc:mask="0x1" edc:name="CNPDJ11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ12" edc:desc="" edc:mask="0x1" edc:name="CNPDJ12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ13" edc:desc="" edc:mask="0x1" edc:name="CNPDJ13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ14" edc:desc="" edc:mask="0x1" edc:name="CNPDJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ15" edc:desc="" edc:mask="0x1" edc:name="CNPDJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
