Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/edc/PIC32MZ2048EFM144.PIC
      <edc:SFRDef edc:_addr="0x1F860870" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------n---n-----------" edc:cname="CNCONJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONJ" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE J" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860880" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNENJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNENJ" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEJ0" edc:desc="" edc:mask="0x1" edc:name="CNIEJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ1" edc:desc="" edc:mask="0x1" edc:name="CNIEJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ2" edc:desc="" edc:mask="0x1" edc:name="CNIEJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ3" edc:desc="" edc:mask="0x1" edc:name="CNIEJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ4" edc:desc="" edc:mask="0x1" edc:name="CNIEJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ5" edc:desc="" edc:mask="0x1" edc:name="CNIEJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ6" edc:desc="" edc:mask="0x1" edc:name="CNIEJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ7" edc:desc="" edc:mask="0x1" edc:name="CNIEJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ8" edc:desc="" edc:mask="0x1" edc:name="CNIEJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ9" edc:desc="" edc:mask="0x1" edc:name="CNIEJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ10" edc:desc="" edc:mask="0x1" edc:name="CNIEJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ11" edc:desc="" edc:mask="0x1" edc:name="CNIEJ11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ12" edc:desc="" edc:mask="0x1" edc:name="CNIEJ12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ13" edc:desc="" edc:mask="0x1" edc:name="CNIEJ13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ14" edc:desc="" edc:mask="0x1" edc:name="CNIEJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ15" edc:desc="" edc:mask="0x1" edc:name="CNIEJ15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860890" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNSTATJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNSTATJ" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATJ0" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ1" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ2" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ3" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ4" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ5" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ6" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ7" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ8" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ9" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ10" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ11" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ12" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ13" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ14" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ15" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8608A0" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNNEJ" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNNEJ" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEJ0" edc:mask="0x1" edc:name="CNNEJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ1" edc:mask="0x1" edc:name="CNNEJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ2" edc:mask="0x1" edc:name="CNNEJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ3" edc:mask="0x1" edc:name="CNNEJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ4" edc:mask="0x1" edc:name="CNNEJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ5" edc:mask="0x1" edc:name="CNNEJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ6" edc:mask="0x1" edc:name="CNNEJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ7" edc:mask="0x1" edc:name="CNNEJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ8" edc:mask="0x1" edc:name="CNNEJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ9" edc:mask="0x1" edc:name="CNNEJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ10" edc:mask="0x1" edc:name="CNNEJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ11" edc:mask="0x1" edc:name="CNNEJ11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ12" edc:mask="0x1" edc:name="CNNEJ12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ13" edc:mask="0x1" edc:name="CNNEJ13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ14" edc:mask="0x1" edc:name="CNNEJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ15" edc:mask="0x1" edc:name="CNNEJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8608B0" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNFJ" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNFJ" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFJ0" edc:mask="0x1" edc:name="CNFJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ1" edc:mask="0x1" edc:name="CNFJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ2" edc:mask="0x1" edc:name="CNFJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ3" edc:mask="0x1" edc:name="CNFJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ4" edc:mask="0x1" edc:name="CNFJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ5" edc:mask="0x1" edc:name="CNFJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ6" edc:mask="0x1" edc:name="CNFJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ7" edc:mask="0x1" edc:name="CNFJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ8" edc:mask="0x1" edc:name="CNFJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ9" edc:mask="0x1" edc:name="CNFJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ10" edc:mask="0x1" edc:name="CNFJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ11" edc:mask="0x1" edc:name="CNFJ11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ12" edc:mask="0x1" edc:name="CNFJ12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ13" edc:mask="0x1" edc:name="CNFJ13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ14" edc:mask="0x1" edc:name="CNFJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ15" edc:mask="0x1" edc:name="CNFJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8608C0" edc:offset="0x50"/>
      <edc:SFRDef edc:_addr="0x1F860910" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="TRISK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------11111111" edc:name="TRISK" edc:nzwidth="0x20" edc:por="------------------------11111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISK0" edc:desc="" edc:mask="0x1" edc:name="TRISK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK1" edc:desc="" edc:mask="0x1" edc:name="TRISK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK2" edc:desc="" edc:mask="0x1" edc:name="TRISK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK3" edc:desc="" edc:mask="0x1" edc:name="TRISK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK4" edc:desc="" edc:mask="0x1" edc:name="TRISK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK5" edc:desc="" edc:mask="0x1" edc:name="TRISK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK6" edc:desc="" edc:mask="0x1" edc:name="TRISK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK7" edc:desc="" edc:mask="0x1" edc:name="TRISK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860920" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="PORTK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------xxxxxxxx" edc:name="PORTK" edc:nzwidth="0x20" edc:por="------------------------xxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RK0" edc:desc="" edc:mask="0x1" edc:name="RK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK1" edc:desc="" edc:mask="0x1" edc:name="RK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK2" edc:desc="" edc:mask="0x1" edc:name="RK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK3" edc:desc="" edc:mask="0x1" edc:name="RK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK4" edc:desc="" edc:mask="0x1" edc:name="RK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK5" edc:desc="" edc:mask="0x1" edc:name="RK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK6" edc:desc="" edc:mask="0x1" edc:name="RK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK7" edc:desc="" edc:mask="0x1" edc:name="RK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860930" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="LATK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------xxxxxxxx" edc:name="LATK" edc:nzwidth="0x20" edc:por="------------------------xxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATK0" edc:desc="" edc:mask="0x1" edc:name="LATK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK1" edc:desc="" edc:mask="0x1" edc:name="LATK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK2" edc:desc="" edc:mask="0x1" edc:name="LATK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK3" edc:desc="" edc:mask="0x1" edc:name="LATK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK4" edc:desc="" edc:mask="0x1" edc:name="LATK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK5" edc:desc="" edc:mask="0x1" edc:name="LATK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK6" edc:desc="" edc:mask="0x1" edc:name="LATK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK7" edc:desc="" edc:mask="0x1" edc:name="LATK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860940" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="ODCK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="ODCK" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCK0" edc:desc="" edc:mask="0x1" edc:name="ODCK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK1" edc:desc="" edc:mask="0x1" edc:name="ODCK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK2" edc:desc="" edc:mask="0x1" edc:name="ODCK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK3" edc:desc="" edc:mask="0x1" edc:name="ODCK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK4" edc:desc="" edc:mask="0x1" edc:name="ODCK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK5" edc:desc="" edc:mask="0x1" edc:name="ODCK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK6" edc:desc="" edc:mask="0x1" edc:name="ODCK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK7" edc:desc="" edc:mask="0x1" edc:name="ODCK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860950" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="CNPUK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CNPUK" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUK0" edc:desc="" edc:mask="0x1" edc:name="CNPUK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK1" edc:desc="" edc:mask="0x1" edc:name="CNPUK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK2" edc:desc="" edc:mask="0x1" edc:name="CNPUK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK3" edc:desc="" edc:mask="0x1" edc:name="CNPUK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK4" edc:desc="" edc:mask="0x1" edc:name="CNPUK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK5" edc:desc="" edc:mask="0x1" edc:name="CNPUK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK6" edc:desc="" edc:mask="0x1" edc:name="CNPUK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK7" edc:desc="" edc:mask="0x1" edc:name="CNPUK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860960" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="CNPDK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CNPDK" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDK0" edc:desc="" edc:mask="0x1" edc:name="CNPDK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK1" edc:desc="" edc:mask="0x1" edc:name="CNPDK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK2" edc:desc="" edc:mask="0x1" edc:name="CNPDK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK3" edc:desc="" edc:mask="0x1" edc:name="CNPDK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK4" edc:desc="" edc:mask="0x1" edc:name="CNPDK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK5" edc:desc="" edc:mask="0x1" edc:name="CNPDK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK6" edc:desc="" edc:mask="0x1" edc:name="CNPDK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK7" edc:desc="" edc:mask="0x1" edc:name="CNPDK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
